manvalan/DigiRadio/Software/sdkconfig.defaults
# DigiRadio — default Kconfig (development / first-board bring-up)
# Security: NVS + flash encryption — see docs/security-flash-nvs.md
# Production release mode: sdkconfig.defaults.production (overlay at build time)

CONFIG_IDF_TARGET="esp32s3"

# Custom partition table (nvs, otadata, OTA slots, dsp blob, nvs_keys)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: mark app valid only after esp_ota_mark_app_valid_cancel_rollback()
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Flash encryption — DEVELOPMENT mode (re-flash plaintext until eFuse policy set)
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
# CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y

# NVS encryption at rest (XTS-AES; keys in nvs_keys, protected by flash encryption)
# CONFIG_NVS_ENCRYPTION=y

# C++23, exceptions and RTTI off (AGENTS.md §2)
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_COMPILER_CXX_STD=23

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
